{"@elliezeiler_video_7304749510314691886.mp3": "Get ready with me for Thanksgiving. Okay I think I'm gonna wear this brown Skims dress. I'm going with brown vibes this year so let's put her on. Okay here's the dress and I'm gonna wear these boots from Stodd. Look like this and then I'm just gonna pair it with this little brown bag. Normal jewelry but I'm adding this beautiful Jimmy Choo ring right here. Okay let me show you guys in different lighting. Here is the final outfit. Happy Thanksgiving!", "@oldrowofficial_video_7304885018436832555.mp3": "Oh shit, hopefully they don't have a ring. God damn it!", "@chashiya_video_7304903646100196650.mp3": "", "@belatown_video_7332270968041262366.mp3": "As you may already be aware, the 66th Annual Grammy Awards took place last night, and likewise, I decided I would surmise my thoughts on the event as well as the big winners. First and foremost, I wanted to give a massive round of kudos to Queen ZZLOC, The Voice, taking home Song of the Year for her smash hit single, Although, Enjoyment from the Barbie soundtrack. I personally just think she looked like an absolute star last night. The hair, the outfit, everything about it is exemplary, and I loved her performance. It made me very emotional. However, I must say my favorite part of the night was seeing both Miley and Hannah take home their respective trophies. As I'm sure you've heard many a times throughout the years, these two ladies did not get along on the set of their shared sitcom. They even got into a fistfight once, allegedly. However, these days, it seems the two of them have put it all behind them and more than buried the hatchet. In fact, during Miley's acceptance speech, you could even see Hannah giving her a standing ovation. It's just heartwarming to see these women finally supporting each other after all these years. And the night came even more full circle when we got to see Daniela Monet take home the Grammy Award for Best New Artist for her hit musical, Chicago. Funny enough, Daniela Monet was actually in the running to play Miley's character on Hannah Montana way back in 2005. It's wonderful. It seems everybody's gotten the best of both worlds. But on a serious note, y'all did sizzle real fucking dirty. This was some bullshit. She won Best R&B Album. I'm sorry, I don't even listen to sizzle like that, but you can't sit here and tell me that album wasn't a whole fucking moment. Like that didn't ship the world the way it did. I'm sorry, did Taylor Swift need another album of the year? Did Billie Eilish need another song of the year? Were they gonna die without it? Be fucking real.", "@belatown_video_7259174781101313326.mp3": "So quite a few people have requested that I make a video detailing the lore of Bailetown, or like the connections between all the different characters. So that's what I'm going to be doing today. So for starters, these are the two main characters, Kendra and Gary. Kendra and Gary actually first dated in high school. They were together for a couple of years. That is until Sarah came into the picture and she made up a rumor that Kendra was cheating on Gary so that she could steal Gary away from Kendra. Once Kendra was out of the picture, Sarah snatches Gary up. She cuts a hole in the condom. She gets pregnant. They get married. Their first child is this here, Melody. Melody, she's got quite a mouth on her. And then they had a second child, Anna Lynn, a couple years later. But this is not biologically Gary's child. And he did not find out about that until a couple years into her life. He still sees her as his daughter, though, and takes care of her accordingly. Eventually, Gary finds out that Sarah has been cheating on him with his brother, Frankie. Now, Frankie and Gary have a very tumultuous relationship. Gary's kind of like a father figure to Frankie. That's how they were when they were younger because their father left at a very young age. However, Frankie has some animosity that he holds towards Gary because of the fact that the reason why their dad left in the first place is because Gary told their mom that the dad was cheating and thereby Frankie kind of blames Gary. So even though Gary's like really good to Frankie and has helped him a lot, Frankie has that kind of resentment towards him that made it okay for him in his mind to sleep with Gary's wife. So after that, Gary and Sarah obviously got a divorce. And that's when he reconnected with Kendra because he found out through his therapist that she works at the McDonald's near him. And, you know, they're now hashing that out. Kendra just recently got out of relationship with Kevin here. He was cheating on her with her ex best friend, Ariel. I think you're familiar with her. Ariel is actually a lesbian, but she's very resentful of the fact that she's a lesbian because she was raised very conservative and Christian. She married Eric. Eric is trans. She doesn't know that Eric is trans though. Eric at some point ended up leaving Ariel for the new Ariel. And now these two are really at each other's throats because they both are in love with him. She's not really in love with him, but like she has a connection to him. It's complicated. Another man that Ariel has involved herself with romantically to distract herself from her homosexuality is Derek here. But Derek is in a long-term relationship with Elsa. He doesn't really love Ariel. Ariel insists that she's in love with him, but she's really not. It appears I'm also going to have to make a part two that should be up right now.", "@taylorswift_video_7273459734785559851.mp3": "This has been the most extraordinary experience of my entire life. We're about to go on a little adventure together and that adventure is going to span 17 years of music. How does that sound? Welcome to the acoustic setting. People would come up to me and they'd be like, are you going to just do a show with all the albums in it? And I was like, yeah, it's going to be called The Eros Tour. See you there.", "@belatown_video_7260686788463824171.mp3": "Well, since we're airing all of our dirty laundry, I have a secret I've been keeping from you, Frankie. Drea, you don't have to tell him right now. Maybe I don't have to, but I want to. I had sex with Brandon. What? You slept with my fiancé, Brandon? You're my own cousin. How could you do this to me? Oh, you're gonna try and talk down to me now? You sure weren't preaching to that choir when you decided to sleep with your brother's wife. How the fuck could you do this to me? Because, like a wise woman once said, there's nothing I do better than revenge. I know all about what you did with my ex-boyfriend. You mean Henry? Yeah, that's right. You slept with him, and I knew you slept with him. So I decided I would pipe your girl before I ever introduced her to you. And just as I planned, you fell in love with her. You had sex with Drea before you ever introduced her to me? Yup! And I had fun doing it! For what it's worth, Frankie, I never cheated on you. My relationship with him ended before we started dating, so don't even try to play victim right now. It's nowhere close to what you did to me. It doesn't matter, Drea. You still lied to me. No, I didn't. You never asked me if I slept with him because I never figured that you had. Were you expecting me to guess that you were sleeping with my best friend while we were engaged? Babe, look. If you can look past what I did to you, I can look past what you did to me. Absolutely not, Frankie. What's done is done. This wedding is over, and so are we. Really? You're just gonna throw it all away like that? Yes, I am! Because it's not much to me anymore. You burnt up every last shred of respect I had for you, Frankie. We're over. Brandon, look. At this point, you're all I have. Wait, what? Are you not mad at me? You're all I have. Gary, he doesn't want anything to do with me anymore. My mom, she doesn't even call me. She was all I had left. Brandon, what do I do? I'm losing you. I don't have a home. I have nothing. Why am I such a terrible person? I don't know what I did. What did I do to deserve to be this kind of person? Wait, Frankie. Really, Melody? Are you happy with yourself? I am happy with myself. Because I exposed you for the type of fucking ranted bitch you are, Sarah. Have a good night. You doing anything later? Oh, get away from me.", "@overtimeboxing_video_7266065989958208814.mp3": "I'm trippin' and dabbin', yeah, I'm causin' a madness, yeah, I'm fuckin' the baddest, yeah, I bought me the Kravis, yeah, I bought me the Jarvis, yeah, I never need practice, my money gon' double or triple, yeah, your money subtracted, yeah, put off on the drinks, put off on the cups, put off on the shwerves, yeah, I ain't even fuckin' with nobody, bitch got a crib and a berth, yeah, this shit coulda gone so bad, this shit coulda gone even worse, yeah, yeah, free wild side, the chain gang bitch, fuck till they burst, I bring out my money the most, I'm richer than all of them nerds, yeah, I'm flexin' the big bankroll, these nuts in my pocket, say, baby, I had a chance at the top, gave the bitch a kick, rippin' the curse till it burns, 20 bucks, savin' our city, we poppin' these pillies, these motherfuckers,", "@belatown_video_7259175761129540907.mp3": "Now, Derek and Elsa's relationship is plagued by the fact that Derek is a serial cheater. He's cheated on her with 20 women and five men. He is also fighting that demon of bisexuality. He insists he's not, but he is. Now, here's where things get a little bit tricky to understand, and I need you to bear with me here. So this is Elsa. This is Ho Elsa. Now, these are two separate people. However, at one point in time, they were the same person. At one point, it was just this Elsa. And this was like up until the end of high school. Mind you, all these people are between the ages of like 28 to 32, but they all went to high school together. A lot of their drama that insists upon all of them originated there. Elsa was deeply, madly in love with her high school boyfriend, and that's when Melissa came into the picture and slept with her boyfriend, and she was so betrayed and so heartbroken that all of the evil inside of her divested and diverted into Ho Elsa. And now Ho Elsa runs around the town just sleeping with everybody's man. However, there is sort of a good side to Ho Elsa. Ho Elsa's promiscuity actually exists less to target the women that she's sleeping with the husbands and boyfriends of, and more to target them. Ho Elsa will purposefully seek out men she suspects of being potential cheaters, offer them sexual advances, and then put herself in a situation where she's going to be caught sleeping with him by the woman. It's kind of like if you've ever seen Dragon Ball Z, where the Namekian Kami like diverts all of the evil inside of him into becoming King Piccolo. However, King Piccolo eventually like becomes a good guy. That's basically Ho Elsa. Her methods are imperfect, but really all she wants is for these women to want better for themselves. Derek has two children. One of them is with Elsa, but it's not biological. It's an adopted child. As Jojo, she's not really that relevant, honestly. She shows up from time to time. He also has Naya, and now this is a little girl that he had with his ex-girlfriend, Sheena. Sheena ended up leaving Derek after he slept with her father, and then she found Greg, and this is her new man. He's a real stand-up guy. They have a child together, Sierra. Sierra and Naya are really close, and Greg takes care of both of them equally. He loves Naya as if that's his own daughter. Another thing worth noting is that Greg and Gary are really good friends. They met as children when they were in 4-H together. The inseparable bond. They haven't been in an episode together yet, but if they are in one, they're very close. And now we have just a few more characters who are kind of out of this loop. Kelsey and Travis. They are a little bit younger than the rest of these guys. Kelsey is 24. Travis is 25. Kelsey and Travis started dating in high school. However, there was a bump in the road when Travis was being groomed by their teacher, Mrs. Hanson. Her name is just Shannon if she's not in the environment of being a teacher. Shannon essentially forced Travis to kind of sleep with her in order to get decent grades. He was a super senior in high school at the time, so he was 19. That's why she defends herself, but it was still really weird of her to do that. Now, Kelsey and Travis were able to make it through this, and they are still together for all intents and purposes. However, even though she's forgiven him, he really hasn't forgiven himself. He still has a lot of shame and guilt. He's taken up a really chronic substance abuse issue. This has not only really negatively affected their relationship, but as well as his relationship with his son, Zeke. Zeke is just a really innocent, wholesome little guy who's been thrust into this really bad situation. Now, Sharon is married to Sonic. However, they both cheat on each other quite a bit. It causes a lot of turmoil in their relationship. They've tried being in an open relationship, but they're both just too jealous. It's very likely they are on the fast track to a divorce. And finally, here we have Leona. She was born into a lot of money. She really doesn't have to work a regular job a day in her life to get by, but because of that, she does a lot of community service. You'll see her helping at the soup kitchen. She works at the rehabilitation center. She sometimes works as like a cop, but the cops in Baylor Town aren't really cops. They're more like social workers. She also works with Child Protective Services. She also is a transgender woman, and because of that, she really likes to use her resources to help out the LGBTQ plus community in Baylor Town. Just overall, a really charitable woman. But yeah, those are the people, and that's the connections between them. I have a lot more characters I still haven't used, and you'll learn their stories later, but that's just what this is for now.", "@kyaboyko_video_7287340941881494790.mp3": "And now I want to sit back and relax and enjoy my evening when all of a sudden I hear this agitating, grating voice.", "@thatrecipe.us_video_7284045695156243754.mp3": "With three potatoes and some meat, I can make a delicious dinner. Start by cutting six large potatoes. Transfer these diced potatoes to a large saucepan, and add one and one half teaspoon of salt with one liter of water. Now cut one onion in half, then cut one of these halves into strips, and finally dice them, and the onions we've just chopped up. Then add one crushed garlic clove, add 500 grams of ground beef. To season it, add one and one half teaspoon of salt, add a generous pinch of black pepper. Meanwhile, to a large bowl, add all those cooked and drained potato dices. Also add 50 grams of unsalted butter, then add one whole egg. Now add 160 grams of wheat flour, then get some of the potato dough and put it over the flour. Flatten dough with the palm of your hands into a circle. Now add two tablespoons of that meat we've set aside, then put one dumpling at a time into the skillet and fry them until golden brown. And I'll also thank you for sharing this recipe. See you next recipe, bye!", "@sophiasuccessstory_video_7254560407778528517.mp3": "Who knew Barbie had a mean right hook? Margot Robbie forgot to hold back when throwing a punch on the set of the Barbie movie, and she accidentally made contact with the poor stuntman. Robbie immediately went to check on the guy and help him to his feet after Cut was called. And all seemed to be peaceful and well in Barbie Land.", "@belatown_video_7260686171070614826.mp3": "If anyone in this room objects to the holy matrimony of Frankie and Drea, please speak now or forever hold your peace. Melody, what are you doing here? It's my uncle's wedding. What do you mean, what am I doing here? Melody, you are not invited for a reason. You are causing a disturbance. Now make your way- Don't even try it with me right now, Sarah. You know damn well why I'm here. And if you aren't gonna tell her, then I will. Melody, I swear to God, if you don't listen to your mother and get out of here right now, then what? What are you gonna do, Sarah? No, really. Bitch, I have you pegged like a goddamn baseball. How can you, as a woman, stand right there next to the very woman you call your best friend and watch her happily get married to a man you know good and well you've been sleeping with? Excuse me, what did you say? You heard me, right? That woman right there, Sarah Cunningham, my mother and your maid of honor, she had sex with your fiancé multiple times, as recent as last week. Sarah, is she telling the truth? Listen, Drea, it's not like that. It's a yes or no question, Sarah. Did you sleep with Frankie? Yes. Bitch, get the fuck out. Fake, wack, trash ass bitch. Hey, hey, hey, get off of her. Really, Frankie? You're gonna protect her? I see how it is now. Baby, it's not like that at all. I love you so much. You love me? Motherfucker, you don't know what love is if this is how you treat somebody you love. I took you in when you had nothing, you sorry sack of shit. Everything you have is because of me. From your car, to your job, to the clothes on your back, and now you're gonna stab me in mine like this? My best friend, Frankie? Really, baby? Listen, she came on to me. Oh, and you thought the appropriate response was to come inside of her? You make me sick. With your own brother's wife, too. You disgust me in every way fathomable. How dare you? How dare you bring me all the way out here in front of all my friends and family to humiliate me like this? I didn't mean to humiliate you. None of this was meant to happen, Dre. I don't- Oh, so what you meant to do was smile in my face and legally bind yourself to me while knowing all of the lies and deceit you close your eyes to at night? Fuck you, asswipe. And you, Sarah? Really? Your own brother-in-law? My fiancé? You dirty ass ho. Oh, so that's what you're gonna do? You're gonna call me a ho? Now, yes, I am gonna call you a ho because that's what you are. A good-for-nothing ass, two-faced, dirty ass ho, just like you always have been. I should have known what you were all about in college when you got that train ran on you by the entire soccer team, and you even tried to get the married coach in on it. Bitch, don't be mad at me. Be mad at your man. It's not my fault he was willing to lay down and get up inside of me. No, it's not. But it is your fault that you decided to lie and disrespect me and ruin what was supposed to be the best day of my life, all because you couldn't keep your homewrecking ass away from mine.", "@ruismind_video_7295177616124939552.mp3": "Oh, um, that was my bathing suit from high school. I was a little bigger then. Oh, I thought that's what they used to cover Connecticut when it rained. Hey, anybody know a good tailor? You need some clothes altered? No, no, I'm just looking for a man to draw on me with chalk. Why don't you go see Frankie? My family's been going to him forever. He did my first suit when I was 15. No, wait. 16. No, excuse me. 15. Alright, when was 1990? Okay, you have to stop the Q-tip when there's resistance. Condoms? Hey, you don't know how long we're going to be in here. We may have to repopulate the earth. And condoms are the way to do that. We'll flip for it. Ducks or clowns? Oh, we're going to flip for the baby? You got a better idea? Alright, call it in here. Heads. Heads it is. Yes! We have to assign heads to something. Right, okay, okay. Ducks is heads because ducks have heads. What kind of scary-ass clowns came to your birthday? Hold on. There's something different. I went to that tanning place your wife suggested. Was that place the sun? Hey, how cool would it be if you could watch like a real life-size version of this, huh? I mean, how crazy would that be? As crazy as soccer? Some girl ate Monica. Shut up. The camera adds 10 pounds. Uh, so how many cameras are actually on you? Oh, sorry. Did I get you? No, you didn't get me. It's an electric drill. You get me, you kill me. Hi. Hi. What's wrong, buddy? Someone at work ate my sandwich. Well, what did the police say? Sup? Sup, dude? You can make whatever you want, just please don't hurt me. So you play a little PlayStation, huh? That's whack. PlayStation is whack. Sup with the whack PlayStation sup? Huh? Come on, am I 19 or what? Yes, on a scale from 1 to 10, 10 being the dumbest a person can look, you are definitely 19. Come on, man, really? How old? Young. You're a man-child, okay? Now go get changed because everybody's ready and please, oh please, keep my underwear. Oh, thanks. Okay. Why is your family Scottish? Why is your family Ross? What happened? Oh, man, he promised he wouldn't take the chairs. What the hell happened? How were you locked in and where the hell is all of our stuff? Well, this guy came by to look at the unit and he said he didn't think it was big enough to fit a grown man. So you got in voluntarily? I was trying to make a sale. Oh, man, if I ever run into that guy again, you know what I'm going to do? Bend over? Would you like some gum? Oh, is it sugarless? Sorry, it's not. Oh, then no thanks. What the hell was that? Mental note, if Jill Goodacre offers you gum, you take it. If she offers you mangled animal carcass, you take it. I mean, just now, just now, there was some woman at the coffee house smiled at me. And then the other day on the subway, a woman accidentally sat on my hand. Dude, don't rub my face in your crazy single life. And then how about this? There's an anthropologist at school who totally came on to me during the interdepartmental potluck dinner. Why did I get married? And it's a book. Oh, it's Dr. Seuss. That book got me through some tough times. There is a little child inside this man. Yes, the doctors say if they remove it, he'll die. Okay. But no accountants. Oh, and no one from, like, legal. I don't like guys with boring jobs. Oh, and Ross was like what, a lion tamer? Oh, my God, what happened? Oh, um, Joey was born. And then 28 years later, I was robbed. Oh, you're the day. You know, this is actually good, because if we ever lose Ross, we have a spare. I don't want to be single, okay? I just, I just, I just want to be married again. And I just want a million dollars. How's the moving on going? Not well. I went on the subway again, and someone did sit on my hand, but that person was neither female nor wearing pants. Well, maybe you're going about this the wrong way. You know, I mean, think about it. White male, divorced three times, two illegitimate children. The personal ad writes itself. That's funny. So do you think you'll ever work again? What are you doing? You know I can only dish it out. I can't believe Rachel just moved on and didn't say anything to me. Look, maybe she didn't move on, you know? Maybe that kiss was just an impulsive one-time birthday thing. About a month ago, she gave her number to some guy in a bar. Did she go out with him? No. When he called, I threw the message away. Ah, the high road. All right, you know what? Enough. Enough talking. I have to get moving. Hey, check out those two blondes over there. Hey, come with me. Are you trying to get everybody divorced? You don't have to do anything. It'll just be easier if it's the two of us, like college. Remember? First you break the ice with some kind of a joke so they know you're the funny one. Then I swoop in with some interesting conversation so they'll see that I'm the brilliant, brooding, sexy one. I thought I got to make the jokes.", "@lynnyprince_video_7304653738533375278.mp3": "You", "@flakeysalt_video_7288466308860038443.mp3": "시청해 주셔서 감사합니다.", "@angelinaa.vo_video_7302461048261512494.mp3": "🎶 Music Outro 🎶", "@devotedly.yours_video_7309965221039361326.mp3": "Israel is trying to convince people that the men they arrested stripped and abused in northern Gaza are Hamas fighters who surrendered but as Montez posted to his stories, these are civilians. They are not Hamas They have nothing to do with Hamas and there are people speaking out saying that some of them are their family members For example, this is Hani and Madhoun if you go to his Instagram and click on the stories He tells you exactly who from his family were arrested. He writes This is the part of Gaza where my family has been sheltering my brother Mahmoud my nephew I booed the one in the white circle and my nephew Omar who is 12 years old have all been Abducted and taken hostages by the Israeli military to an unknown location I also shared that this Israeli site down below shared the picture of his nephew and dad's cousin with captions that they are Hamas operatives Surrendering I am related to half these hostages You see in the Israeli army truck and have absolutely zero connection to Hamas Nor did they surrender to anyone posted my brother Mahmoud can be seen in this IDF released video He is a shopkeeper and a dad and has a seizure and it's blistering cold you also have this map who posted this photo and circled the man above me saying he's a journalist a Correspondent for a lot of be as you deed newspaper. It's very clear They have not found any command centers in a chippa hospital because we would have seen that by now and this is screaming desperation But this is inhumane and downright Disgusting we need to continue to call our reps and demand a ceasefire because enough is enough", "@tyy3324_video_7290289523269963038.mp3": "You make it look like it's magic I see nobody, nobody but you I'm never confused Hey, hey I'm so used to being used So I run when you call, I'm infected Cause I hate when the world takes my time So I'mma care for you, you, you I'mma care for you, you, you, you Yeah Cause girl, you're perfect You're always worth it And you deserve it The way you work it Cause girl, you earned it Girl, you earned it", "@nikotheherb_video_7306292395342171423.mp3": "Y'all did you see a released Israeli hostage wrote Hamas a thank-you note? They Postured It's so over for Israel y'all they're not coming back from this this is There's no way to salvage it like they're giving released Israeli hostages hush orders, so they don't say shit like this and They're ignoring them that if the circumstances weren't already so devastating this would be fucking hilarious", "@mikaylanogueira_video_7327742048801525035.mp3": "Kim Kardashian dropped this absolutely stunning sexy makeup line Anyways, I'm just kidding don't make me relive that this is the new skin by Kim drop We have lipsticks lip liners and an eyeshadow palette as someone who loves KKW Beauty I was ecstatic when she announced this however when the actual product assortment got revealed I got a little nervous because a lot of this looks really warm toned, and I'm cool neutral So hopefully I find something that works for me. Let's start with the eyeshadow palette This is my like actual first impression of this. I have not actually seen this yet Okay, I mean, it's it's exactly what it says classic mattes. These are classic matte colors now listen Listen, I'll always tell you okay. Kim Kardashian is literally my idol. Okay, ask my parents. I grew up idolizing her I love it. I still do but I have to tell you I think this palette looks cheap as fuck I mean the materials it's colour-pop level. Okay, the this should not be $50 100% this should not be $50 and I understand that she's trying to like keep the vibe of the luxe skin line But like if you're gonna do that make the palette a little nicer That's just my opinion aside from that from what I've heard the eyeshadow quality is Exceptional so let's do a look. I'm always gonna use an eye base. I'm first dipping into this cool tone brown I like how the palette has a mix of warm and cool so far. It's buildable and it blends very easily I also really appreciate that She put a black in the palette the black is super pigmented The eyeshadows are lightly pressed in the pan. So you get quite a bit of kickback with all the colors. I Am gonna add some black liner underneath going for like biker chick smoky black liner Listen, it is a good palette. The eyeshadow quality is really good. Do I think you need it? No, I think if you have makeup by Mario Patrick Todd Natasha Denona any of those hood of beauty like you're good It's a pretty eye look though. Let's try the lips go to pack two", "@its_gp_angella_video_7287637795525512494.mp3": "It's a night that we're all supposed to be in. Happy Halloween. Trick or treat. It's a night that we're all supposed to be in. Happy Halloween. Trick or treat. Trick or treat. Trick or treat. Trick or treat.", "@comedyhub622_video_7302607700666502442.mp3": "And the idea, Michael, isn't to try to sabotage each other. It's just to give each other fun jokes. -\"Uh-huh.\" -\"Why?\" -\"Why don't you go first?\" -\"Okay.\" -\"Yeah.\" -\"A student in Texas who is nicknamed White Lightning set a high school record by running the 100-meter dash in 9.98 seconds. Coincidentally, people call me White Lightning because I also finish in under 10 seconds.\" -♪♪ Doctors in Iowa have confirmed a dog disease that can be passed on to humans. Fine, I'll wear a condom. -♪♪ Hmm. Oh, wow. Hmm. Okay. A new report finds that as people move into formerly wild areas of Africa, human activity is disrupting chimpanzee culture. Incidentally, chimpanzee culture is also what my grandpa calls hip-hop. Why? -♪♪ Whoa. I wouldn't have said that. Pope Francis ended a Vatican summit by promising the Catholic Church would confront the clergy's sex abuse head-on instead of their usual way, face-down, ass-up. What? -♪♪ Okay. That's not a... Come on. I know. I think this... It's the gravity. This will be good. Yeah, sure. A substitute teacher in North Carolina has resigned after she reportedly told a class of elementary students that Martin Luther King Jr. killed himself. In her defense, he is the one who decided to keep running his mouth. Why?! Oh! Oh! You're gonna get me murdered.", "@waldorfmindset_video_7273655048163593518.mp3": "And who is the owner? Silencio! No! I won't let go! This peasant's son won't turn and run Because the reckless royal chose another foe! Ah... It's... A.", "@prehist0ricpets6_video_7271686908118469934.mp3": "We got 27 good, whoa, oh my, that, whoa, too short for me, whoa. I don't get nervous, but this time I'm a little bit nervous. I got some bad news, got some good news. Good news is I get to pull the clutch with my daughter. The bad news is there's some bad eggs. The bad news, again, is she'd probably like to tear my head off. So let's do this. So, I actually get to cheat. OK, OK, oh man. This is a big girl, and she's not nice. Her head pops out, let me know. OK, so we'll move that over. There we go. Oh, I never had that happen, and I almost, my hand, pulled my own hand off from the rail. You got it? Oh yeah. Luckily I had it on my side. You notice what I said, it's a good thing my daughter's helping me. I'm like done. Rolling our dinosaur over. OK, so check this out. Oh yeah, she's really cool. Whoop, whoop, whoop, whoop, whoop, whoop, whoop, whoop. Yep, uh-huh. Get ready, guys. She's going to do the whole thing. I'll take it from here. OK, here we go. OK. OK, so the good news is, even though she wants me, man, this is going to be difficult. She's literally waiting for me to get in the exact position that she thinks she can reach. And I borrowed Tim's hook, which is too short for me. But what do I know? What do I know? Now, did you notice, I took my guard down for one second, and she took advantage of that one second. When I said this is a grumpy snake, I ain't kidding. She's actually positioning herself, hiding her body over there, so she can get further than it looks. Oh man, I don't get nervous, but this time I'm a little bit nervous. They ask me all the time, oh, are you ever scared? I always say no, but this time I'm thinking I'm just too tired and slow. OK, come on, girl. OK, come on. OK, there you go. You stay over there and bite the cameraman. OK, so having these is all not that. Whoa, dang. Whoa, told you I felt like I was off my game a little bit. Juliet, why don't you throw yourself in front of it and stop it? Dang, that was so close. Let me wipe its saliva off my face. This clutch is exactly why we take the eggs. They're half bad, half good. Almost 100% chance they'll get maggots, rot, and all the eggs will die. So I think there's only going to need one box today, because there's so many infertile eggs. No, we can't go on that side, because she'll bite us. No, not that side. Go ahead. Go ahead, yeah. The other side. And of course, because these are snake eggs, they have to all be up the same way. Look at that big girl. Hopefully we have enough eggs to get lucky. Oh, man, there's a lot of infertiles, way more than we expected. Whoa. Yep. I need a snake hook. Aisle three. Where did mine go? Where did you dump all the snake hooks? There we go. There we go. There we go. We got them all. So we are successful. Juliet, you've got some quick hands. Now the question is, how do I get grumpy? I know how to get grumpy. Where's that hook? So all I've got to do is I'm going to basically touch her, so she wants to come over and light me up. And when she lights me up, she'll come over on this side. So she's going to work to try to hide body. She'll see her head will stay there, her head will stay there, but she'll get closer and closer with her body so she has more distance of striking. So right now, she's thinking, you know, if I was crazy and I like making videos, I'd take risks. I'm crazy maybe, but I don't want to take risks. So otherwise, I'd show you by, whoa, I'd show you, I would show you what I'm talking about. Now, you're probably thinking right about now, wow, why is he antagonizing her? So here's the deal. I could just grab her by the neck, yank her out, stress her whole life out. Or I can let her just argue with me for a few minutes. And when the argument's over, she'll be like, OK, it's cool. And then she probably won't bite me, probably. But the point is, I won't be strangling her, fighting with her, and making it all crazy. I'm trying to get her to burn her angry energy. And I say angry, it's just protective energy. Unfortunately, with this snake, it's more than protective energy. She's kind of not the nicest snake in the whole world. Do you want to cover those eggs? Yeah. Matter of fact, let's put them in the incubator, and I'm going to deal with this in one second. Because at the end of the day, I don't want her to knock her own eggs over because we're trying to save her eggs and her babies. How many we got in there? I didn't even count them. You guys ready? Guessing? Here we go. 27. 27. What did I say a minute ago? Anyway, we got 27 good. Whoa! I looked at the, as soon as my eyes shift off of her, see how smart this snake is? The second I shifted my eyes off, she knew that I wasn't ready to jump. Almost smoked me. I mean, that is incredible. So that was crazy. You guys just saw one of the closest strikes I've had in a long time. Go to the other side and hold the box. But not, whoa, whoa, whoa, whoa. Whoa! Yep, this one's a little grumpy. This one's spirited, like my children. We like to say passionate. Well, I would not want anything but kids that do have to stand for their own. Come on. And this is one of my kids that's standing for its own right now. It just doesn't realize that dad's right, that I just saved all their babies. OK, just take that off the other side. OK. So, whoop, this is where it gets a little interesting. Oh, come on. Let me tell you, if I didn't have a little bit of skill handling big snakes right now, this would be a whole other video. Whoa! Here, I got a snake hook. There you go. I didn't actually. Come on, girl. Come on. Come on, close your mouth. Close your mouth. Enclosure's right there. Come on. Enclosure's right there, girl. There you go. We'll get her settled down. She'll be back to normal, and we're going to keep living the dream. That was an easy one. That was really a rough one, but I knew it would be. Luckily, she isn't scared enough, unfortunately. Sometimes I'm worried she's going to get bit. Hope you had a great time. And if you haven't met Juliet, there she is. Here I am, honey. Have an awesome day.", "@daniellecohn_video_7295525771836149034.mp3": "Hi guys! I want to show you how I make my lasagna. So I just went ahead and washed these sweet peppers and also got all the seeds out and now I'm just chopping them into small pieces. I'm also going to chop this white onion and I also finished chopping up all of my peppers so just put those to the side. Also I'm only doing half of this onion and my eyes are already watering. I'm literally crying from this onion right now. My eyes are still watering. Okay so once we have all of our veggies now we're gonna go and chop up some garlic. If your store has these get them because I just love them. They make such a difference because it's not like the already minced one it's like garlic cloves peeled. Okay so you can do as many as you want. I usually do like four or five. Don't mind Glacier. Don't know why she's meowing. Chop that up and then we'll start cooking. Okay so my garlic is chopped. I like to leave kind of like some big chunks of it in there. Just me. But if you like garlic it's it's good. Okay so I'm gonna go ahead and pour in some olive oil. Saute my garlic and veggies and then add in the meat. I like to let the garlic kind of cook a little bit then add in the other veggies. Start sizzling like that. You can go ahead and add your veggies. Saute that for a little. Add your meat. So I'm, here's how it looks by the way, I'm using ground beef and ground Italian sweet sausage but you can do really whatever you want. Just saute that around until it looks pretty cooked through. Okay so once you add in your meats you can go ahead and start seasoning them. I like to season them with a couple different things. I like to use adobo and then I'm also going to use a couple more. I'll show you them. Also I'm gonna do some Tony's Creole. Now I'm gonna do some pepper. I'm also going to be adding in oregano and Italian seasoning. So we're gonna do some of those. My eyes are still watering from those onions. Next up I'm just gonna do like a tad bit of paprika, not too much just like a little bit just for the meat to have flavor and then I'm also going to do some garlic salt. I'm not gonna do garlic powder just because I already put a lot of fresh garlic in there but I am gonna do a little bit of garlic salt. So I'm just gonna let the meat cook down with the veggies and then once it's fully cooked I'm gonna add in the sauce and let it simmer for like 10 minutes and then we can start making the lasagna. So I don't add salt just because a lot of the seasonings I use already have a lot of salt in them so it just makes it too salty if you add extra salt. This is the pasta sauce I'm gonna use this one I like it a lot it's good. You can also drain the oil from your meat but I suggest leaving a little bit of it just because it does add flavor. Just letting that all cook down. Okay so I'm gonna go ahead and add my sauce into it just like that. Then I'm gonna go ahead and mix that all up and then let it simmer on low for like 10 minutes just so it can all kind of get all the flavors together nicely. Okay so while that's still cooking I'm gonna start getting the lasagna ready to go in the oven. It's already preheated to 350. I use the oven ready one because it's just so much easier. Also anytime I cook lasagna I use one of these just because it's just way easier. So just lay them down and then add your ricotta and it's easier too if you have a flat noodle. Okay so I just put a few like spoonfuls of ricotta and I'm just smoothing that out onto it. It doesn't have to be pretty because it's just all gonna go together at the end. So once you have like a good layer of the ricotta you can add your sauce on and some like shaved cheese. Also here's what the sauce is looking like. So I'm just gonna take a spoon and start adding this all over. I don't know why I said shaved I meant shredded but then you can just go ahead and add on your shredded cheese. I'm using this aged Italian blend. I like freshly shredded cheese better but it's just so much extra work so I need to get a like one that shreds it for me. And just keep repeating that. I usually do like three layers. It really just depends what you want. Okay so once you've done all of your layers you can go ahead and do the top and I put a lot of cheese on the top because it looks pretty and I love cheese so it'll taste good too. Okay so once you're done with everything you can just, well you don't have to do this, but I like to add some oregano to the top of it and then I put it in the oven for 45 minutes with tin foil and then you take it off and put it in for 15 minutes uncovered. So this is the before and I'll show you guys when it comes out. Okay and this is how it looks after when I just took it out of the oven. And yeah let it sit for like 20-30 minutes and eat it!", "@k00k134_video_7328649663492427050.mp3": "Nicki Minaj is essentially the Dr. Seuss of her time, and what I mean when I say that is she's objectively a disgusting and reprehensible person by pretty much all metrics of basic humanity and common decency, yet her one singular talent that appears to be an innate ability to rhyme words together in a silly fashion that particularly resonates with children has cemented her with a legacy she really does not deserve as much as many female rappers who came before her. In case you're not already up to date, the self-proclaimed queen of rape has spent the past 24 hours deflecting from the fact that her husband is a convicted sexual predator who is not allowed near public parks or elementary schools by making fun of Megan Thee Stallion for getting shot as well as referring to her as Bigfoot. It's always amusing to me how Nicki Minaj immediately jumps to making fun of other people's appearances as if she didn't spend hundreds of thousands of dollars in 2008 getting illegal Craigslist butt injections from some guy in his basement, and not just that, she lied about it for 10 years and only confessed after her ass cheeks were visibly deflating in public and everybody could already tell. And listen, I'm not at all reveling in the fact that she's a terrible person I was a very big Nicki Minaj fan growing up. Ask anybody who went to middle school with me, I loved her so much. I would defend her to anybody who would listen. I saw her doing that And I was like, huh, finally some real music. However, around 2018 when she started intentionally surrounding herself with sex offenders I kind of fell off the wagon She was announcing her associations with them faster than she was dropping new music And it's always especially humorous to me when I see Nicki Minaj as well as her fans attempt to defend her by saying you only Attack the men she associates with for being sexual predators because you don't have anything on her I beg to differ Barb's because not only are we talking about a woman who once gave a lap dance to a 13 year old boy We're talking about a woman who once made a song with a then 16 year old little twist in which she says these lyrics in conclusion. Yeah, she's uh She's going to hell. Let's hope all that silicone doesn't release too many toxic fumes while she's burning", "@zachking_video_7327709847091301674.mp3": "Okay, best burger in five seconds. All you got to do, grab your emoji, pull out the hamburger. Show me this thing. Done. Nothing's done easy with a burger. Seriously? Wait, you can't try it. It's not, oh, it's just an emoji. It's dry. It's cardboard."}